export const SHOPPING_STANDARD = 600;
export const SHOPPING_REMOTE = 1100;

export const REMOTE_WILAYAS_CODES = [
  "01", "03", "07", "11", "30", "33", "32", "39", "37", "45", "47", "49", "50", "51", "52", "53", "54", "55", "56", "57", "58"
];

export const wilayas = [
  "01 - أدرار (1100 دج)",
  "02 - الشلف (600 دج)",
  "03 - الأغواط (1100 دج)",
  "04 - أم البواقي (600 دج)",
  "05 - باتنة (600 دج)",
  "06 - بجاية (600 دج)",
  "07 - بسكرة (1100 دج)",
  "08 - بشار (600 دج)",
  "09 - البليدة (600 دج)",
  "10 - البويرة (600 دج)",
  "11 - تمنراست (1100 دج)",
  "12 - تبسة (600 دج)",
  "13 - تلمسان (600 دج)",
  "14 - تيارت (600 دج)",
  "15 - تيزي وزو (600 دج)",
  "16 - الجزائر (600 دج)",
  "17 - الجلفة (600 دج)",
  "18 - جيجل (600 دج)",
  "19 - سطيف (600 دج)",
  "20 - سعيدة (600 دج)",
  "21 - سكيكدة (600 دج)",
  "22 - سيدي بلعباس (600 دج)",
  "23 - عنابة (600 دج)",
  "24 - قالمة (600 دج)",
  "25 - قسنطينة (600 دج)",
  "26 - المدية (600 دج)",
  "27 - مستغانم (600 دج)",
  "28 - المسيلة (600 دج)",
  "29 - معسكر (600 دج)",
  "30 - ورقلة (1100 دج)",
  "31 - وهران (600 دج)",
  "32 - البيض (1100 دج)",
  "33 - إليزي (1100 دج)",
  "34 - برج بوعريريج (600 دج)",
  "35 - بومرداس (600 دج)",
  "36 - الطارف (600 دج)",
  "37 - تندوف (1100 دج)",
  "38 - تيسمسيلت (600 دج)",
  "39 - الوادي (1100 دج)",
  "40 - خنشلة (600 دج)",
  "41 - سوق أهراس (600 دج)",
  "42 - تيبازة (600 دج)",
  "43 - ميلة (600 دج)",
  "44 - عين الدفلى (600 دج)",
  "45 - النعامة (1100 دج)",
  "46 - عين تموشنت (600 دج)",
  "47 - غرداية (1100 دج)",
  "48 - غليزان (600 دج)",
  "49 - تيميمون (1100 دج)",
  "50 - برج باجي مختار (1100 دج)",
  "51 - أولاد جلال (1100 دج)",
  "52 - بني عباس (1100 دج)",
  "53 - عين صالح (1100 دج)",
  "54 - عين قزام (1100 دج)",
  "55 - توقرت (1100 دج)",
  "56 - جانت (1100 دج)",
  "57 - المغير (1100 دج)",
  "58 - المنيعة (1100 دج)"
];

export const communes: { [key: string]: string[] } = {
  "01 - أدرار (1100 دج)": [
    "أدرار", "اقبلي", "أولف", "بودة", "فنوغيل", "إن زغمير", "أولاد أحمد تيمي", "رقان", "سالي", "السبع", "تامنطيط", "تامست", "تيمقتن", "تيت", "تسابيت", "زاوية كنتة"
  ],
  "02 - الشلف (600 دج)": [
    "أبو الحسن", "عين مران", "بنايرية", "بني بوعتاب", "بني حواء", "بني راشد", "بوقادير", "بوزغاية", "بريرة", "الشطية", "الشلف", "الظهرة", "الحجاج", "الكريمية", "المرسى", "حرشون", "الهرانفة", "الأبيض مجاجة", "مصدق", "وادي الفضة", "وادي قوسين", "وادي سلي", "أولاد عباس", "أولاد بن عبد القادر", "أولاد فارس", "أم الدروع", "سنجاس", "سيدي عبد الرحمن", "سيدي عكاشة", "الصبحة", "تاجنة", "تلعصة", "تاوقريت", "تنس", "الزبوجة"
  ],
  "03 - الأغواط (1100 دج)": [
    "أفلو", "عين ماضي", "عين سيدي علي", "البيضاء", "بن ناصر بن شهرة", "بريدة", "العسافية", "الغيشة", "الحويطة", "قلتة سيدي سعد", "الحاج مشري", "حاسي الدلاعة", "حاسي الرمل", "الخنق", "قصر الحيران", "الأغواط", "وادي مرة", "وادي مزي", "سبقاق", "سيدي بوزيد", "سيدي مخلوف", "تاجموت", "تاجرونة", "تاويالة"
  ],
  "04 - أم البواقي (600 دج)": [
    "عين ببوش", "عين البيضاء", "عين الديس", "عين فكرون", "عين كرشة", "عين مليلة", "عين الزيتون", "بحير الشرقي", "بريش", "بئر الشهداء", "الضلعة", "العامرية", "البلالة", "الجازية", "الفجوج بوغرارة سعودي", "الحرملية", "فكيرينة", "هنشير تومغني", "قصر الصباحي", "مسكيانة", "وادي نيني", "أولاد قاسم", "أولاد حملة", "أولاد زواي", "أم البواقي", "الرحية", "سيقوس", "سوق نعمان", "الزرق"
  ],
  "05 - باتنة (600 دج)": [
    "عين جاسر", "عين التوتة", "عين ياقوت", "أريس", "عزيل عبد القادر", "بريكة", "باتنة", "بني فضالة الحقانية", "بيطام", "بولهيلات", "بومقر", "بومية", "بوزينة", "الشمرة", "شير", "جرمة", "الجزار", "الحاسي", "المعذر", "فسديس", "فم الطوب", "غسيرة", "القصبات", "القيقبة", "حيدوسة", "إشمول", "إينوغيسن", "كيمل", "قصر بلزمة", "لارباع", "لازرو", "لمسان", "إمدوكل", "معافة", "منعة", "مروانة", "نقاوس", "وادي الشعبة", "وادي الماء", "وادي الطاقة", "أولاد عمار", "أولاد عوف", "أولاد فاضل", "أولاد سلام", "أولاد سي سليمان", "عيون العصافير", "الرحبات", "رأس العيون", "سفيان", "سقانة", "سريانة", "تكوت", "تالخمت", "تاكسلانت", "تازولت", "ثنية العابد", "تيغانمين", "تغرغار", "تيلاطو", "تيمقاد", "زانة البيضاء"
  ],
  "06 - بجاية (600 دج)": [
    "أدكار", "أيت رزين", "أيت إسماعيل", "أقبو", "أكفادو", "أمالو", "أميزور", "أوقاس", "برباشة", "بجاية", "بني جليل", "بني كسيلة", "بني مليكش", "بني معوش", "بو جليل", "بوحمزة", "بوخليفة", "شلاطة", "شميني", "درقينة", "ذراع القايد", "الفلاي", "القصر", "فناية الماثن", "فرعون", "أوزلاقن", "إغيل علي", "اغرم", "كنديرة", "خراطة", "مسيسنة", "مالبو", "وادي غير", "صدوق", "سيدي عياد", "سيدي عيش", "سمعون", "سوق لإثنين", "سوق اوفلا", "تالة حمزة", "تامقرة", "تامريجت", "تاوريرت إغيل", "تاسكريوت", "تازمالت", "طيبان", "تيشي", "تيفرة", "تيمزريت", "تينبدار", "تيزي نبربر", "توجة"
  ],
  "07 - بسكرة (1100 دج)": [
    "عين الناقة", "عين زعطوط", "بسكرة", "برج بن عزوز", "بوشقرون", "برانيس", "شتمة", "جمورة", "الفيض", "الغروس", "الحاجب", "الحوش", "القنطرة", "الوطاية", "فوغالة", "خنقة سيدي ناجي", "ليشانة", "ليوة", "مشونش", "مخادمة", "المزيرعة", "مليلي", "أوماش", "أورلال", "سيدي عقبة", "طولقة", "زريبة الوادي"
  ],
  "08 - بشار (600 دج)": [
    "العبادلة", "بشار", "بني ونيف", "بوكايس", "عرق فراج", "القنادسة", "لحمر", "مشرع هواري بومدين", "المريجة", "موغل", "تبلبالة", "تاغيت"
  ],
  "09 - البليدة (600 دج)": [
    "عين الرمانة", "بني مراد", "بني تامو", "بن خليل", "البليدة", "بوعرفة", "بوفاريك", "بوقرة", "بوعينان", "الشبلي", "الشفة", "الشريعة", "جبابرة", "العفرون", "قرواو", "حمام ملوان", "الأربعاء", "مفتاح", "موزاية", "وادي جر", "وادي العلايق", "اولاد سلامة", "أولاد يعيش", "صوحان", "الصومعة"
  ],
  "10 - البويرة (600 دج)": [
    "أغبالو", "أهل القصر", "عين الحجر", "عين العلوي", "عين الترك", "عين بسام", "أيت لعزيز", "أعمر", "بشلول", "بئر غبالو", "برج أوخريص", "بودربالة", "البويرة", "بوكرم", "شرفة", "الدشمية", "ديرة", "جباحية", "العجيبة", "الأسنام", "الهاشمية", "الخبوزية", "الحاكمية", "المقراني", "قرومة", "الحجرة الزرقاء", "حيزر", "حنيف", "قادرية", "الأخضرية", "أمشدالة", "معلة", "المعمورة", "مزدور", "وادي البردي", "أولاد راشد", "روراوة", "ريدان", "سحاريج", "سوق الخميس", "سور الغزلان", "تاغزوت", "تاقديت", "آث  منصور", "زبربر"
  ],
  "11 - تمنراست (1100 دج)": [
    "ابلسة", "عين امقل", "أدلس", "تمنراست", "تاظروك"
  ],
  "12 - تبسة (600 دج)": [
    "عين الزرقاء", "بجن", "بكارية", "بئر الذهب", "بئر مقدم", "بئر العاتر", "بوخضرة", "بولحاف الدير", "الشريعة", "الكويف", "الماء الابيض", "المريج", "المزرعة", "العقلة", "العقلة المالحة", "العوينات", "الحويجبات", "فركان", "قريقر", "الحمامات", "مرسط", "نقرين", "الونزة", "أم علي", "صفصاف الوسرى", "سطح قنطيس", "تبسة", "ثليجان"
  ],
  "13 - تلمسان (600 دج)": [
    "عين فتاح", "عين فزة", "عين غرابة", "عين الكبيرة", "عين النحالة", "عين تالوت", "عين يوسف", "عمير", "باب العسة", "بني بهدل", "بني بوسعيد", "بني خلاد", "بني مستر", "بني وارسوس", "بني صميل", "بني سنوس", "بن سكران", "بوحلو", "البويهي", "شتوان", "دار يغمراسن", "جبالة", "العريشة", "العزايل", "الفحول", "القور", "فلاوسن", "الغزوات", "حمام بوغرارة", "الحناية", "هنين", "مغنية", "منصورة", "مرسى بن مهيدي", "مسيردة الفواقة", "ندرومة", "وادي الخضر", "أولاد ميمون", "أولاد رياح", "الرمشي", "صبرة", "سبعة شيوخ", "سبدو", "سيدي العبدلي", "سيدي الجيلالي", "سيدي مجاهد", "السواحلية", "السواني", "سوق الثلاثاء", "تيرني بني هديل", "تيانت", "تلمسان", "زناتة"
  ],
  "14 - تيارت (600 دج)": [
    "عين بوشقيف", "عين الذهب", "عين دزاريت", "عين الحديد", "عين كرمس", "بوقرة", "شحيمة", "دحموني", "جبيلات الرصفاء", "جيلالي بن عمار", "الفايجة", "فرندة", "قرطوفة", "حمادية", "قصر الشلالة", "مادنة", "مهدية", "مشرع الصفا", "مدريسة", "مدروسة", "مغيلة", "ملاكو", "الناظورة", "النعيمة", "وادي ليلي", "الرحوية", "الرشايقة", "السبعين", "السبت", "سرغين", "سي عبد الغني", "سيدي عبد الرحمن", "سيدي علي ملال", "سيدي بختي", "سيدي حسني", "السوقر", "تاقدمت", "تخمرت", "تيارت", "تيدة", "توسنينة", "زمالة  الأمير عبد القادر"
  ],
  "15 - تيزي وزو (600 دج)": [
    "أبي يوسف", "أغريب", "أقني قغران", "عين الحمام", "عين الزاوية", "أيت عقـواشة", "أيت بــوادو", "أيت بومهدي", "أيت خليلي", "أيت يحي موسى", "أيت عيسى ميمون", "أيت شافع", "أيت محمود", "أيت  أومالو", "أيت تودرت", "أيت يحيى", "اقبيل", "أقرو", "أسي يوسف", "عزازقة", "أزفون", "بنــــي زمنزار", "بني عيسي", "بني دوالة", "بني يني", "بني زيكــي", "بوغني", "بوجيمة", "بونوح", "بوزقــن", "ذراع بن خدة", "ذراع الميزان", "فريحة", "فريقات", "إبودرارن", "إيجــار", "إفــرحــونان", "إيفيغاء", "إفليـــسن", "إيلـيــلتـن", "إيلولة أومـــالو", "إمســوحال", "إيرجـــن", "الأربعــاء ناث إيراثن", "معـــاتقة", "ماكودة", "مشطراس", "مقــلع", "ميزرانـــة", "مكيرة", "واسيف", "واضية", "واقنون", "سيدي نعمان", "صوامـــع", "سوق الإثنين", "تادمايت", "تيقـزيرت", "تيمـيزار", "تيرمتين", "تيزي نثلاثة", "تيزي غنيف", "تيزي وزو", "تيزي راشد", "إعــكورن", "يطــافن", "زكري"
  ],
  "16 - الجزائر (600 دج)": [
    "عين بنيان", "عين طاية", "الجزائر الوسطى", "باب الوادي", "باب الزوار", "بابا حسن", "باش جراح", "براقي", "ابن عكنون", "بني مسوس", "بئر مراد رايس", "بئر خادم", "بئر توتة", "بولوغين بن زيري", "برج البحري", "برج الكيفان", "بوروبة", "بوزريعة", "القصبة", "الشراقة", "الدار البيضاء", "دالي ابراهيم", "جسر قسنطينة", "الدويرة", "الدرارية", "العاشور", "الابيار", "الحراش", "المدنية", "المغارية", "المرسى", "المرادية", "الحمامات", "هراوة", "حسين داي", "حيدرة", "الخرايسية", "القبة", "الكاليتوس", "المعالمة", "محمد بلوزداد", "المحمدية", "وادي قريش", "وادي السمار", "اولاد شبل", "اولاد فايت", "الرحمانية", "الرايس حميدو", "رغاية", "الرويبة", "السحاولة", "سيدي امحمد", "سيدي موسى", "سويدانية", "سطاوالي", "تسالة المرجة", "زرالدة"
  ],
  "17 - الجلفة (600 دج)": [
    "عين الشهداء", "عين الإبل", "عين فقه", "عين معبد", "عين وسارة", "عمورة", "بنهار", "بن يعقوب", "بيرين", "بويرة الأحداب", "الشارف", "دار الشيوخ", "دلدول", "الجلفة", "دويس", "القديد", "الادريسية", "الخميس", "فيض البطمة", "قرنيني", "قطارة", "حد الصحاري", "حاسي بحبح", "حاسي العش", "حاسي فدول", "مسعد", "مليليحة", "مجبارة", "أم العظام", "سد الرحال", "سلمانة", "سيدي بايزيد", "سيدي لعجال", "تعظميت", "زعفران", "زكار"
  ],
  "18 - جيجل (600 دج)": [
    "برج الطهر", "بودريعة بني  ياجيس", "بوراوي بلهادف", "بوسيف أولاد عسكر", "الشحنة", "الشقفة", "الجمعة بني حبيبي", "جيملة", "العنصر", "العوانة", "القنار نشفي", "الميلية", "الامير عبد القادر", "أراقن سويسي", "غبالة", "جيجل", "قاوس", "خيري واد عجول", "وجانة", "أولاد رابح", "أولاد يحيى خدروش", "سلمى بن زيادة", "السطارة", "سيدي عبد العزيز", "سيدي معروف", "الطاهير", "تاكسنة", "زيامة منصورية"
  ],
  "19 - سطيف (600 دج)": [
    "عين عباسة", "عين أرنات", "عين أزال", "عين الكبيرة", "عين الحجر", "عين ولمان", "عين لقراج", "عين الروى", "عين السبت", "أيت نوال مزادة", "ايت تيزي", "عموشة", "بابور", "بازر سكرة", "بيضاء برج", "بلاعة", "بني شبانة", "بني فودة", "بني ورتيلان", "بني وسين", "بني عزيز", "بني موحلي", "بئر حدادة", "بئر العرش", "بوعنداس", "بوقاعة", "بوسلام", "بوطالب", "الدهامشة", "جميلة", "ذراع قبيلة", "العلمة", "أوريسيا", "الولجة", "قلال", "قلتة زرقاء", "قنزات", "قجال", "حمام السخنة", "الحامة", "حمام قرقور", "حربيل", "قصر الابطال", "معاوية", "ماوكلان", "مزلوق", "واد البارد", "أولاد عدوان", "أولاد صابر", "أولاد سي أحمد", "أولاد تبان", "الرصفة", "صالح باي", "سرج الغول", "سطيف", "تاشودة", "تالة إيفاسن", "الطاية", "التلة", "تيزي نبشار"
  ],
  "20 - سعيدة (600 دج)": [
    "عين الحجر", "عين السخونة", "عين السلطان", "دوي ثابت", "الحساسنة", "هونت", "المعمورة", "مولاي العربي", "أولاد إبراهيم", "أولاد خالد", "سعيدة", "سيدي احمد", "سيدي عمر", "سيدي بوبكر", "تيرسين", "يوب"
  ],
  "21 - سكيكدة (600 دج)": [
    "عين بوزيان", "عين شرشار", "عين قشرة", "عين زويت", "عزابة", "بكوش لخضر", "بن عزوز", "بني بشير", "بني ولبان", "بني زيد", "بين الويدان", "بوشطاطة", "الشرايع", "القل", "جندل سعدي محمد", "الحروش", "الغدير", "الحدائق", "المرسى", "مجاز الدشيش", "السبت", "فلفلة", "حمادي كرومة", "قنواع", "الكركرة", "خناق مايو", "وادي الزهور", "الولجة بولبلوط", "أولاد عطية", "أولاد حبابة", "أم الطوب", "رمضان جمال", "صالح بو الشعور", "سيدي مزغيش", "سكيكدة", "تمالوس", "زردازة", "الزيتونة"
  ],
  "22 - سيدي بلعباس (600 دج)": [
    "عين البرد", "عين قادة", "عين الثريد", "عين تندمين", "عين أدن", "العمارنة", "بضرابين المقراني", "بلعربي", "بن باديس", "بن عشيبة شلية", "بئر الحمام", "بوجبهة البرج", "بوخنفيس", "شيطوان البلايلة", "الضاية", "الحصيبة", "حاسي دحو", "حاسي زهانة", "لمطار", "مكدرة", "مرحوم", "مسيد", "مرين", "مزاورو", "مصطفى بن ابراهيم", "مولاي سليسن", "وادي السبع", "وادي سفيون", "وادي تاوريرة", "راس الماء", "رجم دموش", "السهالة الثورة", "سفيزف", "سيدي علي بن يوب", "سيدي علي بوسيدي", "سيدي بلعباس", "سيدي ابراهيم", "سيدي شعيب", "سيدي دحو الزاير", "سيدي حمادوش", "سيدي خالد", "سيدي لحسن", "سيدي يعقوب", "طابية", "تاودموت", "تفسور", "تغاليمت", "تلاغ", "تنيرة", "تسالة", "تلموني", "زروالة"
  ],
  "23 - عنابة (600 دج)": [
    "عين الباردة", "عنابة", "برحال", "شطايبي", "الشرفة", "البوني", "العلمة", "الحجار", "واد العنب", "سرايدي", "سيدي عمار", "التريعات"
  ],
  "24 - قالمة (600 دج)": [
    "عين بن بيضاء", "عين العربي", "عين مخلوف", "عين رقادة", "عين صندل", "بلخير", "بن جراح", "بني مزلين", "برج صباط", "بوحشانة", "بوحمدان", "بوعاتي محمود", "بوشقوف", "بومهرة أحمد", "الدهوارة", "جبالة الخميسي", "الفجوج", "قلعة بوصبع", "قالمة", "حمام دباغ", "حمام النبايل", "هيليوبوليس", "نشماية", "لخزارة", "مجاز عمار", "مجاز الصفاء", "هواري بومدين", "وادي الشحم", "وادي فراغة", "وادي الزناتي", "رأس العقبة", "الركنية", "سلاوة عنونة", "تاملوكة"
  ],
  "25 - قسنطينة (600 دج)": [
    "عين عبيد", "عين السمارة", "أبن باديس الهرية", "بني حميدان", "قسنطينة", "ديدوش مراد", "الخروب", "حامة بوزيان", "ابن زياد", "بوجريو مسعود", "أولاد رحمون", "زيغود يوسف"
  ],
  "26 - المدية (600 دج)": [
    "عين بوسيف", "عين اقصير", "العيساوية", "عزيز", "بعطة", "بن شكاو", "بني سليمان", "البرواقية", "بئر بن عابد", "بوغار", "بوعيش", "بوعيشون", "بوشراحيل", "بوغزول", "بوسكن", "الشهبونية", "شلالة العذاورة", "شنيقل", "دراق", "جواب", "ذراع السمار", "العزيزية", "القلب الكبير", "الحمدانية", "الحوضان", "العمارية", "العوينات", "حناشة", "الكاف الاخضر", "خمس جوامع", "قصر البخاري", "مغراوة", "المدية", "مجبر", "مزغنة", "مفاتحة", "ميهوب", "عوامري", "وادي حربيل", "أولاد عنتر", "أولاد بوعشرة", "أولاد إبراهيم", "أولاد دايد", "أولاد امعرف", "أولاد هلال", "أم الجليل", "وزرة", "الربعية", "السانق", "سدراية", "سغوان", "سي المحجوب", "سيدي دامد", "سيدي نعمان", "سيدي الربيع", "سيدي زهار", "سيدي زيان", "السواقي", "تابلاط", "تفراوت", "تمسقيدة", "تيزي مهدي", "ثلاث دوائر", "الزبيرية"
  ],
  "27 - مستغانم (600 دج)": [
    "عشعاشة", "عين بودينار", "عين نويسي", "عين سيدي الشريف", "عين تادلس", "بن عبد المالك رمضان", "بوقيراط", "فرناقة", "حجاج", "حاسي ماماش", "الحسيان (بني ياحي", "خضرة", "خير الدين", "منصورة", "مزغران", "ماسرة", "مستغانم", "نكمارية", "وادي الخير", "أولاد بوغالم", "أولاد مع الله", "صفصاف", "صيادة", "سيدي علي", "سيدي بلعطار", "سيدي لخضر", "سيرات", "السوافلية", "سور", "ستيدية", "تزقايت", "الطواهرية"
  ],
  "28 - المسيلة (600 دج)": [
    "عين الحجل", "عين الملح", "عين فارس", "عين الخضراء", "عين الريش", "بلعايبة", "بن سرور", "بني يلمان", "بن زوه", "برهوم", "بئر فضة", "بوسعادة", "بوطي السايح", "شلال", "دهاهنة", "جبل مساعد", "الهامل", "الحوامد", "حمام الضلعة", "خطوطي سد الجير", "خبانة", "المعاضيد", "معاريف", "مقرة", "مسيف", "امجدل", "مناعة", "محمد بوضياف", "المسيلة", "المطارفة", "ونوغة", "أولاد عدي لقبالة", "أولاد دراج", "أولاد ماضي", "أولاد منصور", "أولاد سيدي ابراهيم", "أولاد سليمان", "ولتام", "سيدي عيسى", "سيدي عامر", "سيدي هجرس", "سيدي امحمد", "سليم", "السوامع", "تامسة", "تارمونت", "زرزور"
  ],
  "29 - معسكر (600 دج)": [
    "عين فارس", "عين فكان", "عين فراح", "عين أفرص", "العلايمية", "عوف", "بنيان", "بوهني", "بوحنيفية", "الشرفاء", "البرج", "القعدة", "الغمري", "القطنة", "الحشم", "القرط", "المأمونية", "المنور", "فراقيق", "فروحة", "غروس", "غريس", "قرجوم", "حسين", "خلوية", "ماقضة", "ماوسة", "معسكر", "المطمور", "مقطع الدوز", "المحمدية", "نسمط", "عقاز", "وادي الأبطال", "وادي التاغية", "رأس عين عميروش", "سجرارة", "السهايلية", "سيدي عبد الجبار", "سيدي عبد المومن", "سيدي بوسعيد", "سيدي قادة", "سيق", "تيغنيف", "تيزي", "زهانة", "زلامطة"
  ],
  "30 - ورقلة (1100 دج)": [
    "عين البيضاء", "البرمة", "حاسي بن عبد الله", "حاسي مسعود", "انقوسة", "ورقلة", "الرويسات", "سيدي خويلد"
  ],
  "31 - وهران (600 دج)": [
    "عين البية", "عين الكرمة", "عين الترك", "أرزيو", "بن فريحة", "بطيوة", "بئر الجير", "بوفاتيس", "بوسفر", "بوتليليس", "العنصر", "البراية", "الكرمة", "السانية", "قديل", "حاسي بن عقبة", "حاسي بونيف", "حاسي مفسوخ", "مرسى الحجاج", "المرسى الكبير", "مسرغين", "وهران", "وادي تليلات", "سيدي بن يبقى", "سيدي الشحمي", "طفراوي"
  ],
  "32 - البيض (1100 دج)": [
    "عين العراك", "اربوات", "بوعلام", "بوقطب", "بوسمغون", "بريزينة", "الشقيق", "شلالة", "البيض", "الأبيض سيدي الشيخ", "البنود", "الخيثر", "المحرة", "الغاسول", "الكاف الأحمر", "كراكدة", "رقاصة", "سيدي عامر", "سيدي سليمان", "سيدي طيفور", "ستيتن", "توسمولين"
  ],
  "33 - إليزي (1100 دج)": [
    "برج عمر إدريس", "دبداب", "إيليزي", "إن أمناس"
  ],
  "34 - برج بوعريريج (600 دج)": [
    "عين تاغروت", "عين تسرة", "برج بوعريريج", "بليمور", "بن داود", "بئر قاصد علي", "برج الغدير", "برج زمورة", "القلة", "جعافرة", "العش", "الياشير", "العناصر", "الحمادية", "الماين", "المهير", "غيلاسة", "حرازة", "حسناوة", "خليل", "القصور", "المنصورة", "مجانة", "أولاد أبراهم", "أولاد دحمان", "أولاد سيدي ابراهيم", "الرابطة", "رأس الوادي", "سيدي أمبارك", "تفرق", "تقلعيت", "تسامرت", "ثنية النصر", "تيكستار"
  ],
  "35 - بومرداس (600 دج)": [
    "أعفير", "عمال", "بغلية", "بن شود", "بني عمران", "برج منايل", "بودواو", "بودواو البحري", "بومرداس", "بوزقزة قدارة", "شعبة العامر", "قورصو", "دلس", "جنات", "الخروبة", "حمادي", "يسر", "خميس الخشنة", "الاربعطاش", "لقاطة", "الناصرية", "أولاد عيسى", "أولاد هداج", "أولاد موسى", "سي مصطفى", "سيدي داود", "سوق الحد", "تاورقة", "الثنية", "تيجلابين", "تيمزريت", "زموري"
  ],
  "36 - الطارف (600 دج)": [
    "عين العسل", "عين الكرمة", "عصفور", "بن مهيدي", "بريحان", "البسباس", "بوقوس", "بوحجار", "بوثلجة", "شبيطة مختار", "الشافية", "شحاني", "الذرعـان", "الشط", "العيون", "القالة", "الطارف", "حمام بني صالح", "بحيرة الطيور", "وادي الزيتون", "رمل السوق", "السوارخ", "زريزر", "الزيتونة"
  ],
  "37 - تندوف (1100 دج)": [
    "أم العسل", "تندوف"
  ],
  "38 - تيسمسيلت (600 دج)": [
    "عماري", "بني شعيب", "بني لحسن", "برج بونعامة", "برج الأمير عبد القادر", "بوقائد", "خميستي", "الأربعاء", "لرجام", "العيون", "الأزهرية", "المعاصم", "الملعب", "أولاد بسام", "سيدي عابد", "سيدي بوتشنت", "سيدي العنتري", "سيدي سليمان", "تملاحت", "ثنية الاحد", "تيسمسيلت", "اليوسفية"
  ],
  "39 - الوادي (1100 دج)": [
    "البياضة", "بن  قشة", "الدبيلة", "دوار الماء", "العقلة", "الوادي", "قمار", "الحمراية", "حساني عبد الكريم", "حاسي خليفة", "كوينين", "المقرن", "اميه وانسة", "النخلة", "وادي العلندة", "ورماس", "الرقيبة", "الرباح", "سيدي عون", "تغزوت", "الطالب العربي", "الطريفاوي"
  ],
  "40 - خنشلة (600 دج)": [
    "عين الطويلة", "بابار", "بغاي", "بوحمامة", "ششار", "شلية", "جلال", "الحامة", "المحمل", "الولجة", "انسيغة", "قايس", "خنشلة", "خيران", "مصارة", "متوسة", "أولاد رشاش", "الرميلة", "طامزة", "تاوزيانت", "يابوس"
  ],
  "41 - سوق أهراس (600 دج)": [
    "عين سلطان", "عين الزانة", "بئر بوحوش", "الدريعة", "الحدادة", "الحنانشة", "الخضارة", "خميسة", "المشروحة", "مداوروش", "المراهنة", "وادي الكبريت", "أولاد إدريس", "أولاد مومن", "أم العظايم", "ويلان", "الراقوبة", "سافل الويدان", "سدراتة", "سيدي فرج", "سوق أهراس", "تاورة", "ترقالت", "تيفاش", "الزعرورية", "الزوابي"
  ],
  "42 - تيبازة (600 دج)": [
    "أغبال", "أحمر العين", "عين تاقورايت", "الحطاطبة", "بني ميلك", "بوهارون", "بواسماعيل", "بورقيقة", "الشعيبة", "شرشال", "الداموس", "دواودة", "فوكة", "قوراية", "حجوط", "حجرة النص", "خميستي", "القليعة", "الأرهاط", "مناصر", "مراد", "مسلمون", "الناظور", "سيدي غيلاس", "سيدي راشد", "سيدي سميان", "سيدي عامر", "تيبازة"
  ],
  "43 - ميلة (600 دج)": [
    "أحمد راشدي", "عين البيضاء أحريش", "عين الملوك", "عين التين", "اعميرة اراس", "بن يحي عبد الرحمن", "بوحاتم", "شلغوم العيد", "الشيقارة", "دراحي بوصلاح", "العياضي برباس", "مشيرة", "فرجيوة", "القرارم قوقة", "حمالة", "ميلة", "مينار زارزة", "وادي العثمانية", "وادي النجاء", "وادي سقان", "أولاد اخلوف", "الرواشد", "سيدي خليفة", "سيدي مروان", "تاجنانت", "تسدان حدادة", "التلاغمة", "ترعي باينان", "تسالة لمطاعي", "تيبرقنت", "يحي بني قشة", "زغاية"
  ],
  "44 - عين الدفلى (600 دج)": [
    "عين البنيان", "عين بويحيى", "عين الدفلى", "عين الاشياخ", "عين السلطان", "عين التركي", "عريب", "بربوش", "بطحية", "بلعاص", "بن علال", "بئر ولد خليفة", "برج الأمير خالد", "بومدفع", "بوراشد", "جليدة", "جمعة أولاد الشيخ", "جندل", "العبادية", "العامرة", "العطاف", "الماين", "حمام ريغة", "الحسانية", "الحسينية", "خميس مليانة", "المخاطرية", "مليانة", "وادي الشرفاء", "واد الجمعة", "الروينة", "سيدي الأخضر", "تاشتة زقاغة", "طارق بن زياد", "تبركانين", "زدين"
  ],
  "45 - النعامة (1100 دج)": [
    "عين بن خليل", "عين الصفراء", "عسلة", "جنين بورزق", "البيوض", "القصدير", "مكمن بن عمار", "المشرية", "مغرار", "النعامة", "سفيسيفة", "تيوت"
  ],
  "46 - عين تيموشنت (600 دج)": [
    "أغلال", "عين الأربعاء", "عين الكيحل", "عين تموشنت", "عين الطلبة", "عقب الليل", "بني صاف", "بوزجار", "شعبة اللحم", "شنتوف", "العامرية", "المالح", "المساعيد", "الأمير عبد القادر", "حمام بوحجر", "الحساسنة", "حاسي الغلة", "وادي برقش", "وادي الصباح", "أولاد بوجمعة", "أولاد الكيحل", "ولهاصة الغرابة", "سيدي بن عدة", "سيدي بومدين", "سيدي ورياش", "سيدي صافي", "تامزورة", "تارقة"
  ],
  "47 - غرداية (1100 دج)": [
    "بريان", "بونورة", "ضاية بن ضحوة", "العطف", "غرداية", "القرارة", "المنصورة", "متليلي", "سبسب", "زلفانة"
  ],
  "48 - غليزان (600 دج)": [
    "عين الرحمة", "عين طارق", "عمي موسى", "بلعسل بوزقزة", "بن داود", "بني درقن", "بني زنطيس", "دار بن عبد الله", "جديوية", "الحاسي", "الحمادنة", "الولجة", "القطار", "المطمر", "حد الشكالة", "حمري", "القلعة", "لحلاف", "مازونة", "مديونة", "منداس", "مرجة سيدي عابد", "واريزان", "وادي الجمعة", "وادي السلام", "وادي رهيو", "أولاد يعيش", "أولاد سيدي الميهوب", "الرمكة", "غليزان", "سيدي  خطاب", "سيدي لزرق", "سيدي أمحمد بن علي", "سيدي امحمد بن عودة", "سيدي سعادة", "سوق الحد", "يلل", "زمورة"
  ],
  "49 - تيميمون (1100 دج)": [
    "أوقروت", "شروين", "دلدول", "قصر قدور", "المطارفة", "أولاد عيسى", "أولاد السعيد", "طالمين", "تيميمون", "تنركوك"
  ],
  "50 - برج باجي مختار (1100 دج)": [
    "برج باجي مختار", "تيمياوين"
  ],
  "51 - أولاد جلال (1100 دج)": [
    "بسباس", "الشعيبة", "الدوسن", "أولاد جلال", "رأس الميعاد", "سيدي  خالد"
  ],
  "52 - بني عباس (1100 دج)": [
    "بني عباس", "بن يخلف", "الواتة", "إقلي", "كرزاز", "القصابي", "أولاد خضير", "تامترت", "تيمودي"
  ],
  "53 - عين صالح (1100 دج)": [
    "عين صالح", "فقارة الزوى", "إينغر"
  ],
  "54 - عين قزام (1100 دج)": [
    "عين قزام", "تين زواتين"
  ],
  "55 - تقرت (1100 دج)": [
    "بن ناصر", "بلدة اعمر", "العالية", "الحجيرة", "المقارين", "المنقر", "النزلة", "سيدي سليمان", "الطيبات", "تبسبست", "تماسين", "تقرت", "الزاوية العابدية"
  ],
  "56 - جانت (1100 دج)": [
    "برج الحواس", "جانت"
  ],
  "57 - المغير (1100 دج)": [
    "جامعة", "المغير", "المرارة", "أم الطيور", "سيدي عمران", "سيدي خليل", "سطيل", "تندلة"
  ],
  "58 - المنيعة (1100 دج)": [
    "المنيعة", "حاسي الفحل", "حاسي القارة"
  ]
};

export function getDeliveryPrice(formattedWilayaString: string): number {
  const code = formattedWilayaString.split(" - ")[0];
  if (REMOTE_WILAYAS_CODES.includes(code)) {
    return SHOPPING_REMOTE;
  }
  return SHOPPING_STANDARD;
}

export function getCommunesByWilaya(formattedWilayaString: string): string[] {
  if (communes[formattedWilayaString]) {
    return communes[formattedWilayaString];
  }
  const code = formattedWilayaString.split(" - ")[0];
  const matchedKey = Object.keys(communes).find(key => key.startsWith(code + " -"));
  return matchedKey ? communes[matchedKey] : [];
}

export function getWilayaByCode(code: string) {
  return wilayas.find(w => w.startsWith(code + " -"));
}